import time
print("WANDU_TIPING_GAME━━━━━━━━━━━━━━━━━━━━━━━━Test.Ver")
print("📢공지사항━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━")
print("Test ver. 1.0의 새소식━━━━━━━━━━━━━━━━━━━━━━━━━━━━")
print("'완두 타이핑 게임'에 오신 것을 환영합니다.")
print("이제 여기에 업데이트 소식이 실릴 것입니다.")
print("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━")
print('게임을 시작하시려면 "start"를 입력하세요.')
startMSG = input(">>")
if startMSG == "start":
    print("타이핑 게임 [G1]")
    print("룰 설명 : 제시어가 주어지면 상대보다 먼저 제시어를")
    print("입력하면 승리하게 됩니다,")
    print("5판 3선승제로 최대 5라운드까지 있습니다.")
    print("(듀스는 포함되지 않습니다.)")
    print("")
    while True:
        if startGame == True:
            break
    print("게임이 시작됩니다.")
    TypigGab = "완두콩바보의반대의반대의반대의반대의반대"
    print(TypigGab)
    sandeOk = False
    print("제시어 : " + TypigGab)
    #def input():
        #while True
            #Taza = input("빨리 입력하세요! >>")
            #MSG Taza
            #if SvRtern == O-"OK"
            #    print("정답입니다.")
            #    imbrack = True
            #    breck
            #else:
            #    print("땡!")

    #def sandezundab():
    #    while True
    #        if imbrack == True
    #            break